In [3]:
import mysql.connector
import pandas as pd

In [2]:
connection = mysql.connector.connect(
        host="localhost",
        database="analytics",
        user="root",
        password="1234",
        port="3306"
    )
cursor = connection.cursor()

In [24]:
products = pd.read_pickle("p.pkl")
ratings = pd.read_pickle("r.pkl")
sales = pd.read_pickle("sales.pkl")
stores= pd.read_pickle("stores.pkl")
customers= pd.read_pickle("c.pkl")

In [32]:
customers

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,Age
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,85
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,45
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26,77
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17,67
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19,58
...,...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,1936-03-25,88
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,1992-02-16,32
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,1937-11-09,86
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,1937-10-12,87
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,1965-08-18,59

In [26]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
 10  Age          15266 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(8)
memory usage: 1.3+ MB

In [120]:
###customer table 
create_query = '''CREATE TABLE IF NOT EXISTS CUSTOMER_INFO(CustomerKey  INT , GENDER VARCHAR(10), NAME VARCHAR(50), CITY VARCHAR(100),
                                                       STATECODE TEXT ,STATE VARCHAR(50), ZIPCODE TEXT, COUNTRY VARCHAR(50), CONTINENT VARCHAR(50),
                                                         BIRTHDAY DATE , AGE INT)'''
cursor.execute(create_query)

In [119]:
# Assuming 'cursor' is your database cursor
drop_table_query = "DROP TABLE IF EXISTS CUSTOMER_INFO;"
cursor.execute(drop_table_query)

# Commit the changes
connection.commit()

In [121]:
insert_query = ''' INSERT INTO CUSTOMER_INFO(CustomerKey, Gender, Name, City, StateCode, State, ZipCode, Country, Continent, Birthday, Age)
                                        VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
df1 = customers.values.tolist()
cursor.executemany(insert_query,df1)
connection.commit()  # Commit the transaction

In [30]:
print(customers.isnull().sum())  # Display the count of NaN values in each column

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
Age             0
dtype: int64

In [31]:
customers['State Code'].fillna(value=0, inplace=True)  # or any other appropriate value

C:\Users\lejoc\AppData\Local\Temp\ipykernel_17844\180964055.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customers['State Code'].fillna(value=0, inplace=True)  # or any other appropriate value

In [35]:
df1 = customers.values.tolist()
df1[1]

[325,
 'Female',
 'Madison Hull',
 'MOUNT BUDD',
 'WA',
 'Western Australia',
 '6522',
 'Australia',
 'Australia',
 Timestamp('1979-09-27 00:00:00'),
 45]

In [45]:
stores.head(2)

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008

In [46]:
print(stores.isnull().sum())  # Display the count of NaN values in each column

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [ ]:
stores['Square Meters'].fillna(value=0, inplace=True)  # or any other appropriate value

In [123]:
### stores table
create_query = ''' CREATE TABLE IF NOT EXISTS STORES(STOREKEY INT , COUNTRY VARCHAR(50), STATE TEXT ,
                                             SQUARE_METERS DECIMAL(10,2) , OPEN_DATE DATE)'''
cursor.execute(create_query)

In [122]:
# Assuming 'cursor' is your database cursor
drop_table_query = "DROP TABLE IF EXISTS STORES;"
cursor.execute(drop_table_query)

# Commit the changes
connection.commit()

In [124]:
insert_query = ''' INSERT INTO STORES(STOREKEY , COUNTRY , STATE , SQUARE_METERS, OPEN_DATE) VALUES(%s,%s,%s,%s,%s)'''
df2=stores.values.tolist()
cursor.executemany(insert_query,df2)
connection.commit()  # Commit the transaction

In [59]:
stores['Open Date'] = pd.to_datetime(stores['Open Date']).dt.strftime('%Y-%m-%d')

In [60]:
df2=stores.values.tolist()
df2[1]

[2, 'Australia', 'Northern Territory', 665.0, '2008-01-12']

In [64]:
sales

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaT,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaT,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [65]:
sales['Order Date'] = pd.to_datetime(sales['Order Date']).dt.strftime('%Y-%m-%d')
sales['Delivery Date'] = pd.to_datetime(sales['Delivery Date']).dt.strftime('%Y-%m-%d')

In [66]:
sales.head(5)

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,NaN,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD

In [67]:
print(sales.isnull().sum())

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [77]:
sales['Delivery Date'].fillna(value=pd.NaT, inplace=True)  # or any other appropriate value

In [88]:
sales['Delivery Date'] = pd.to_datetime(sales['Delivery Date'].replace(0, pd.NaT), errors='coerce')

In [87]:
sales.head(2)

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD

In [94]:
# Display duplicate rows
duplicate_rows = sales[sales.duplicated(keep=False)]
print(duplicate_rows)

Empty DataFrame
Columns: [Order Number, Line Item, Order Date, Delivery Date, CustomerKey, StoreKey, ProductKey, Quantity, Currency Code]
Index: []

In [95]:
duplicate_orders = sales[sales.duplicated(subset='Order Number', keep=False)]
print(duplicate_orders)

       Order Number  Line Item  Order Date Delivery Date  CustomerKey  \
1            366001          1  2016-01-01    2016-01-13      1269051
2            366001          2  2016-01-01    2016-01-13      1269051
3            366002          1  2016-01-01    2016-01-12       266019
4            366002          2  2016-01-01    2016-01-12       266019
5            366002          3  2016-01-01    2016-01-12       266019
...             ...        ...         ...           ...          ...
62877       2243029          5  2021-02-20    2021-02-27       887764
62878       2243029          6  2021-02-20    2021-02-27       887764
62881       2243032          1  2021-02-20    2021-02-23       331277
62882       2243032          2  2021-02-20    2021-02-23       331277
62883       2243032          3  2021-02-20    2021-02-23       331277

       StoreKey  ProductKey  Quantity Currency Code
1             0        1048         2           USD
2             0        2007         1           USD
3             0        1106         7           CAD
4             0         373         1           CAD
5             0        1080         4           CAD
...         ...         ...       ...           ...
62877         0        1449         4           EUR
62878         0        1456         2           EUR
62881         0        1613         2           CAD
62882         0        1717         2           CAD
62883         0         464         7           CAD

[53686 rows x 9 columns]

In [126]:
### sales table
create_query = ''' CREATE TABLE IF NOT EXISTS SALES(ORDER_NUMBER INT , LINE_ITEM INT, ORDER_DATE DATE, DELIVERY_DATE DATE , CUSTOMER_KEY INT , 
                                                        STORE_KEY INT , PRODUCT_KEY INT , QUANTITY INT , CURRENCY_CODE TEXT)'''
cursor.execute(create_query)

In [ ]:
df3=sales.values.tolist()
df3[0:5]

In [125]:
drop_table_query = "DROP TABLE IF EXISTS SALES;"
cursor.execute(drop_table_query)

# Commit the changes
connection.commit()

In [127]:
insert_query = '''INSERT INTO SALES(ORDER_NUMBER,LINE_ITEM, ORDER_DATE , DELIVERY_DATE , CUSTOMER_KEY , STORE_KEY , PRODUCT_KEY , QUANTITY ,CURRENCY_CODE)
                            VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s)'''
cursor.executemany(insert_query,df3)
connection.commit()

In [100]:
print(ratings.isna().sum())

Date                         0
Currency                     0
Exchange                     0
Values                       0
Currency_converted_to_USD    0
dtype: int64

In [102]:
ratings["Date"] = pd.to_datetime(ratings["Date"]).dt.strftime('%y-%m-%d')

In [103]:
ratings.head()

       Date Currency  Exchange  Values  Currency_converted_to_USD
0  15-01-01      USD    1.0000       1                   1.000000
1  15-01-01      CAD    1.1583       1                   0.863334
2  15-01-01      AUD    1.2214       1                   0.818733
3  15-01-01      EUR    0.8237       1                   1.214034
4  15-01-01      GBP    0.6415       1                   1.558846

In [129]:
create_query = '''CREATE TABLE IF NOT EXISTS RATINGS ( DATE DATE , CURRENCY TEXT , EXCHANGE FLOAT , VALUES_cal INT , CURRENCY_IN_USD FLOAT)'''
cursor.execute(create_query)

In [128]:
drop_table_query = "DROP TABLE IF EXISTS RATINGS;"
cursor.execute(drop_table_query)

# Commit the changes
connection.commit()

In [130]:
insert_query = '''INSERT INTO RATINGS(DATE , CURRENCY , EXCHANGE , VALUES_cal ,CURRENCY_IN_USD ) VALUES (%s,%s,%s,%s,%s)'''
df4 = ratings.values.tolist()
cursor.executemany(insert_query,df4)
connection.commit()

In [113]:
products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [112]:
# Remove dollar signs, commas, and any leading/trailing whitespace
products['Unit Cost USD'] = products['Unit Cost USD'].replace({'\$': '', ',': '', '': '0'}, regex=True).str.strip().astype(float)
products['Unit Price USD'] = products['Unit Price USD'].replace({'\$': '', ',': '', '': '0'}, regex=True).str.strip().astype(float)

In [132]:
create_query = ''' CREATE TABLE IF NOT EXISTS PRODUCT( PRODUCT_KEY INT, PRODUCT_NAME TEXT, BRAND TEXT , COLOR VARCHAR(25), UNIT_COST  DECIMAL(10,2), 
                                                    UNIT_PRICE  DECIMAL(10,2) , SUBCATEGORY_KEY INT , SUBCATEGORY TEXT, CATEGORY_KEY INT , CATEGORY TEXT)'''
cursor.execute(create_query)

In [131]:
drop_table_query = "DROP TABLE IF EXISTS PRODUCT;"
cursor.execute(drop_table_query)

# Commit the changes
connection.commit()

In [133]:
insert_query = '''INSERT INTO PRODUCT (PRODUCT_KEY, PRODUCT_NAME, BRAND, COLOR, UNIT_COST, UNIT_PRICE , SUBCATEGORY_KEY, SUBCATEGORY, CATEGORY_KEY, CATEGORY) 
                                        VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)'''
df5 = products.values.tolist()
cursor.executemany(insert_query,df5)
connection.commit()

In [ ]:
df5 = products.values.tolist()
df5[0:5]